/**
 * 双层循环都是先循环一个外层,再多次循环内层，再接着循环外层，依次内推
 * 比较所有相邻元素，如果第一个比第二个大则交换它们。
 * 一轮下来，可以保证最后一个数最大。
 * 执行n-1轮，就可以完成排序。
 * 把大的往后放
 * 数组变换过程：
 [ 2, 3, 4, 1, 5 ]
 [ 2, 3, 1, 4, 5 ]
 [ 2, 1, 3, 4, 5 ]
 [ 1, 2, 3, 4, 5 ]
 * 循环过程：i => j
 0 => 0, 1, 2, 3
 1 => 0, 1, 2
 2 => 0, 1
 3 => 0
 */
const arr91: number[] = [5, 2, 3, 4, 1];

for (let i = 0; i < arr91.length - 1; i += 1) {

    for (let j = 0; j < arr91.length - 1 - i; j += 1) {
        if (arr91[j] > arr91[j + 1]) {
            const temp = arr91[j];
            arr91[j] = arr91[j + 1];
            arr91[j + 1] = temp;
        }
    }
}

console.log(arr91)